/*
Задача 43: Написать программу, которая на вход принимает массив из любого количества элементов (не менее 6)в промежутке от 0 до 100, а на выходе выводит этот же массив, но отсортированный по возрастанию(от меньшего числа к большему).
*/

int size = new Random().Next(6, 101);
int[] array = GetArray(size, 0, 100);
Console.WriteLine($"[{string.Join(", ", array)}]");
Console.WriteLine("Отсортированный массив:");
Console.WriteLine($"[{string.Join(", ", sortArray(array))}]");

//--------------Методы--------------
int[] GetArray(int size, int minValue, int maxValue)
{
    int[] array = new int[size];
    for (int i = 0; i < size; i++)
    {
        array[i] = new Random().Next(minValue, maxValue + 1);
    }
    return array;
}

int[] sortArray(int[] array)
{
    int tmp = 0;
    for (int i = 0; i < array.Length; i++)
    {
        for (int j = 0; j < array.Length - 1 - i; j++)
        {
            if (array[j] > array[j + 1])
            {
                tmp = array[j];
                array[j] = array[j + 1];
                array[j + 1] = tmp;
            }
        }
    }
    return array;
}